---
kind: property
id: P:Autodesk.Revit.DB.IndependentTag.RotationAngle
zh: 标记、打标、标签
source: html/3b257113-5220-c9df-dd3c-50e1e28b847b.htm
---
# Autodesk.Revit.DB.IndependentTag.RotationAngle Property

**中文**: 标记、打标、标签

The rotation angle of the tag relative to its view

## Syntax (C#)
```csharp
public double RotationAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: Angle can only be changed for AnyModelDirection orientation